#ifndef NAME_TABLE_FUNC_H
#define NAME_TABLE_FUNC_H


#include "NameTableType.h"


// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция создания таблицы имен
 @param [in] table Указатель на структуру таблицы имен
*/
int nameTableCtr (NameTable_t* table);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция удаления структуры таблицы имен
 @param [in] table Указатель на структуру таблицы имен
*/
int nameTableDtr (NameTable_t* table);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция поиска имени в таблице имен
 @param [in] table Указатель на структуру таблицы имен
 @param [in] name Полученное имя
 @return Индекс имени в массива в случае поиска, иначе -1
*/
int nameTableFind (NameTable_t* table,
                   NameType_t name);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция сравнения имен таблицы имен
 @param [in] name_1 Первое имя
 @param [in] name_2 Второе имя
 @return 0, если совпадают, иначе 1
*/
int compareName (NameType_t name_1,
                 NameType_t name_2);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция, возвращающая имя, лежащее под полученным индексом
 @param [in] table Указатель на таблицу имен
 @param [in] index Полученный индекс
 @return Имя
*/
NameType_t nameTableGetName (NameTable_t* table,
                             int index);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция добавления элемента в таблицу имен
 @param [in] table Указатель на таблицу имен
 @param [in] name Имя добавляемого объекта
 @param [in] value Значение, соответствующее имени
 @return Индекс имени в таблице имен (при ошибке -1)
*/
int nameTableAdd (NameTable_t* table,
                  NameType_t name,
                  NameValue_t value);
// ---------------------------------------------------------------------------------------------------





#endif // NAME_TABLE_FUNC_H
