#ifndef BIN_TREE_FUNC_H
#define BIN_TREE_FUNC_H

#include "BinTreeType.h"

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция создания бинарного дерева
 @note Сразу создается первый элемент
 @return Структуру дерева
*/
BinTree_t binTreeCtr ();
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция выделения памяти под новый объект
 @note Связи необходимо прописать вручную
 @return Указатель на блок памяти, где хранится новый узел
*/
Node_t* newNode ();
// ---------------------------------------------------------------------------------------------------


// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция удаления дерева
 @param [in] tree Указатель на структуру дерева
*/
int binTreeDtr (BinTree_t* tree);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Рекурсивная функция удаления поддерева
 @param [in] node Указатель на корень поддерева
*/
int deleteNode (Node_t* node);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция сохранения дерева в файл
 @param [in] tree Указатель на структуру дерева
*/
int binTreeSave (BinTree_t* tree);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Рекурсивная функция сохранения поддерева в файл
 @param [in] stream Указатель на файл, куда будет производится запись
 @param [in] node Указатель на корень поддерева
 @param [in] table_var Таблица имен с переменными
 @param [in] table_cmd Таблица имен с кодовыми словами
*/
int saveNode (FILE* stream,
              Node_t* node,
              NameTable_t* table_var,
              NameTable_t* table_cmd);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция загрузки дерева из файла
 @param [in] tree Указатель на структуру дерева
*/
int binTreeUpload (BinTree_t* tree);
// -------------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Рекурсивная функция парсинга буфера
 @param [in] parent Указатель на родительский элемент
 @param [in] cur_pose Указатель на адрес хранения адреса текущего рассматриваемого символа
 @param [in] table_var Таблица имен переменных
 @param [in] table_cmd Таблица имен команд
 @return Указатель на новый узел в случае необходимости его создания, иначе NULL
*/
Node_t* uploadNode (Node_t* parent,
                    char** cur_pose,
                    NameTable_t* table_var,
                    NameTable_t* table_cmd);
// -------------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция нахождения длины имени (до первого ' ')
 @param [in] name Полученное имя
 @return Длина имени
*/
int lenName (const char* name);
// -------------------------------------------------------------------------------------------------------

// ----------------------------------------------------------------------------------------------------
/**
 * @brief Функция скипа всего ненужного синтаксиса, указанного в SYNTAX_VOID
 * @param [in] Указатель на адрес хранения текущего символа
*/
int skipVoid (char** cur_pose);
// ----------------------------------------------------------------------------------------------------

// ----------------------------------------------------------------------------------------------------
/**
 @brief Функция поиска переменной в таблице имен
 @param [in] node Указатель на корень поддерева
 @param [in] table_var Таблица имен
 @param [in] name Имя переменной
 @return 0, если нет переменной, иначе 1 и больше
*/
int findVar (Node_t* node,
             NameTable_t* table_var,
             const char* name);
// -------------------------------------------------------------------------------------------------------


// -------------------------------------------------------------------------------------------------------
/**
 * @brief Функция дампа дерева
 * @param [in] tree Указатель на структуру дерева
 * @param [in] reason Причина дампа
*/
int dumpTree (BinTree_t* tree,
              const char* reason);
// -------------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------------
/**
 * @brief Функция создания графа по дереву
 * @param [in] tree Указатель на причину дампа
 * @return 0 (если не было ошибок), иначе 1
*/
int createGraph (BinTree_t* tree);
// -------------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------------
/**
 * @brief Рекурсивная функция создания блоков графа
 * @param [in] node Указатель на текущий узел
 * @param [in] file Указатель на dot файл
 * @return 0
*/
int createBlock (Node_t* node,
                 FILE* file);
// -------------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------------
/**
 * @brief Рекурсивная функция создания связей между блоками
 * @param [in] node Указатель на текущий узел
 * @param [in] file Указатель на dot файл
 * @return 0
*/
int createLine (Node_t* node,
                FILE* file);
// -------------------------------------------------------------------------------------------------------



#endif // BIN_TREE_FUNC_H
