#ifndef BIN_TREE_CALC_H
#define BIN_TREE_CALC_H

#include "../Header/BinTreeType.h"
#include "../../Common/Common.h"

// --------------------------------------------------------------------------------------------------
/// @brief Функция обработки ошибки в математических операциях
#define CALC_ERROR(reason, ret_val)     \
    do {                                \
        printf ("%s", reason);          \
        DIFF_Error (reason);            \
        return ret_val;                 \
     } while (0)
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/// @brief Окрестность нуля
const double EPS = 1e-12;
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 @brief Функция расчета математических операций
 @param [in] node Указатель на узел с операцией
 @return Указатель на числовой узел
*/
Node_t* calc_Math (Node_t* node);
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 @brief Функция расчета тригонометрических операций
 @param [in] node Указатель на узел с операцией
 @return Указатель на числовой узел
*/
Node_t* calc_Trig (Node_t* node);
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 @brief Функция расчета обратных тригонометрических операций
 @param [in] node Указатель на узел с операцией
 @return Указатель на числовой узел
*/
Node_t* calc_ATrig (Node_t* node);
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 @brief Функция расчета степенных операций
 @param [in] node Указатель на узел с операцией
 @return Указатель на числовой узел
*/
Node_t* calc_Degree (Node_t* node);
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 @brief Функция расчета гиперболических операций
 @param [in] node Указатель на узел с операцией
 @return Указатель на числовой узел
*/
Node_t* calc_Hype (Node_t* node);
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 @brief Функция вычисления факториала
 @param [in] node Указатель на узел с операцией
 @return Указатель на числовой узел
*/
Node_t* calc_Fact (Node_t* node);
// --------------------------------------------------------------------------------------------------


// --------------------------------------------------------------------------------------------------
/**
 @brief Функция взятия cot (x)
 @param [in] x Полученный аргумент
 @return cot (x)
*/
double cot (double x);
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 @brief Функция взятия acot (x)
 @param [in] x Полученный аргумент
 @return acot (x)
*/
double acot (double x);
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 @brief Функция взятия coth (x)
 @param [in] x Полученный аргумент
 @return coth (x)
*/
double coth (double x);
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 @brief Рекурсивная функция нахождения факториала
 @param [in] x Полученный аргумент
 @return Факториал аргумента
*/
double fact (double x);
// --------------------------------------------------------------------------------------------------




#endif // BIN_TREE_CALC_H
