#ifndef BIN_TREE_FUNC_H
#define BIN_TREE_FUNC_H

#include "BinTreeType.h"
#include "../../Common/Comands.h"

// ---------------------------------------------------------------------------------------------------
#define GET_MACRO_NODE_DUMP(a_1, a_2, a_3, NAME, ...) NAME

/// @brief Распределитель макросов в зависимости от количества аргументов
#define LATEX(...) \
    GET_MACRO_NODE_DUMP(__VA_ARGS__, LATEX3, LATEX2)(__VA_ARGS__)

/// @brief Дамп в LaTex при отсутствии причины
#define LATEX2(node, table)                 \
    do {                                    \
        dumpToLaTex (node, table, NULL);    \
    } while (0)

/// @brief Дамп в LaTex при наличии причины
#define LATEX3(node, table, text)           \
    do {                                    \
        dumpToLaTex(node, table, text);     \
    } while (0)
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
#define GET_MACRO_TREE_DUMP(_a_1, _a_2, NAME, ...) NAME

/// @brief Распределитель макросов в зависимости от количества аргументов

#define TREE_LATEX(...) \
    GET_MACRO_TREE_DUMP(__VA_ARGS__, TREE_LATEX2, TREE_LATEX1)(__VA_ARGS__)

/// @brief Дамп дерева в LaTex при отсТейлораутствии причины
#define TREE_LATEX1(tree)                   \
    do {                                    \
        binTreeDumpLaTex (tree, NULL);      \
    } while (0)

/// @brief Дамп дерева в LaTex при наличии причины
#define TREE_LATEX2(tree, reason)           \
    do {                                    \
        binTreeDumpLaTex (tree, reason);    \
    } while (0)
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция создания бинарного дерева
 @param [in] tree Структура дерева
 @note Сразу создается первый элемент
*/
int binTreeCtr (BinTree_t* tree);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция выделения памяти под новый объект
 @note Связи необходимо прописать вручную
 @return Указатель на блок памяти, где хранится новый узел
*/
Node_t* newNode ();
// ---------------------------------------------------------------------------------------------------


// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция удаления дерева
 @param [in] tree Указатель на структуру дерева
*/
int binTreeDtr (BinTree_t* tree);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Рекурсивная функция удаления поддерева
 @param [in] node Указатель на корень поддерева
*/
int deleteNode (Node_t* node);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция сохранения дерева в файл
 @param [in] tree Указатель на структуру дерева
*/
int binTreeSave (BinTree_t* tree);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Рекурсивная функция сохранения поддерева в файл
 @param [in] stream Указатель на файл, куда будет производится запись
 @param [in] node Указатель на корень поддерева
 @param [in] table_var Таблица имен с переменными
 @param [in] table_cmd Таблица имен с кодовыми словами
*/
int saveNode (FILE* stream,
              Node_t* node,
              NameTable_t* table_var,
              NameTable_t* table_cmd);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция загрузки дерева из файла
 @param [in] tree Указатель на структуру дерева
 @param [in] file Имя файла, из которого произойдет загрузка
*/
int binTreeUpload (BinTree_t* tree,
                   const char* file);
// -------------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Рекурсивная функция парсинга буфера
 @param [in] parent Указатель на родительский элемент
 @param [in] cur_pose Указатель на адрес хранения адреса текущего рассматриваемого символа
 @param [in] table_var Таблица имен переменных
 @param [in] table_cmd Таблица имен команд
 @return Указатель на новый узел в случае необходимости его создания, иначе NULL
*/
Node_t* uploadNode (Node_t* parent,
                    char** cur_pose,
                    NameTable_t* table_var,
                    NameTable_t* table_cmd);
// -------------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция нахождения длины имени (до первого ' ')
 @param [in] name Полученное имя
 @return Длина имени
*/
int lenName (const char* name);
// -------------------------------------------------------------------------------------------------------

// ----------------------------------------------------------------------------------------------------
/**
 * @brief Функция скипа всего ненужного синтаксиса, указанного в SYNTAX_VOID
 * @param [in] Указатель на адрес хранения текущего символа
*/
int skipVoid (char** cur_pose);
// ----------------------------------------------------------------------------------------------------

// ----------------------------------------------------------------------------------------------------
/**
 @brief Функция поиска переменной в таблице имен
 @param [in] node Указатель на корень поддерева
 @param [in] table_var Таблица имен
 @param [in] name Имя переменной
 @return 0, если нет переменной, иначе 1 и больше
*/
int findVar (Node_t* node,
             NameTable_t* table_var,
             const char* name);
// -------------------------------------------------------------------------------------------------------

// ----------------------------------------------------------------------------------------------------
/**
 @brief Функция нахождения размера поддерева
 @param [in] node Указатель на корень поддерева
 @return Размер поддерева
*/
size_t getSizeTree (Node_t* node);
// --------------------------------------------------------------------------------------------------




// --------------------------------------------------------------------------------------------------
/**
 @brief Функция дифференцирования дерева
 @param [in] old_tree Указатель на структуру старого дерева
 @param [in] new_tree Указатель на структуру нового дерева
 @note Удаляет старое
*/
int binTreeDiff (BinTree_t* old_tree,
                 BinTree_t* new_tree);
// -------------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 @brief Рекурсивная функция дифференцирования поддерева
 @param [in] old_node Указатель на узел старого поддерева
 @param [in] new_parent Указатель на родитель узла нового поддерева
 @param [in] name_var Переменная дифференцирования
 @param [in] table_var Таблица переменных
 @return Указатель на корень поддерева
*/
Node_t* diffNode (Node_t* old_node,
                  Node_t* new_parent,
                  char* name_var,
                  NameTable_t* table_var);
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 @brief Функция копирования поддерева в новое поддерево
 @param [in] old_node Указатель на корень старого поддерева
 @param [in] new_parent Указатель на корень нового поддерева
 @return Указатель на созданное поддерево
*/
Node_t* copyNode (Node_t* old_node,
                  Node_t* new_parent);
// -------------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 @brief Функция получения переменной дифференцирования
 @param [in] tree Указатель на структуру дерева
*/
int getVarDiff (BinTree_t* tree);
// -------------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 @brief Функция добавления узла с операцией
 @param [in] left Левое поддерево нового узла
 @param [in] right Правое поддерево нового узла
 @param [in] parent Родитель нового узла
 @param [in] oper Тип добавляемой операции
 @return Указатель на новой узел
*/
Node_t* createOperNodeBin (Node_t* left,
                           Node_t* right,
                           Node_t* parent,
                           ALL_OPER oper);
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 @brief Функция добавления узла с операцией
 @param [in] right Правое поддерево нового узла
 @param [in] parent Родитель нового узла
 @param [in] oper Тип добавляемой операции
 @return Указатель на новой узел
 @note left = NULL
*/
Node_t* createOperNodeAtom (Node_t* right,
                            Node_t* parent,
                            ALL_OPER oper);
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 @brief Функция создания узла с переменной
 @param [in] parent Указатель на родительский узел
 @param [in] index Индекс переменной в таблице имен
 @return Указатель на новый узел
*/
Node_t* createVarNode (Node_t* parent,
                       int index);
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 @brief Функция создания узла с числом
 @param [in] parent Указатель на родительский узел
 @param [in] value Значение числа
 @return Указатель на новый узел
*/
Node_t* createNumNode (Node_t* parent,
                       double value);
// -------------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 @brief Функция взятия производной сложной функции
 @param [in] new_oper Производная операции
 @param [in] old_oper Первоначальная операция
 @param [in] parent Указатель на родительский узел
 @param [in] table_var Таблица имен
 @param [in] name_var Имя переменной, по которой берется производная
 @return Указатель на корень нового поддерева
*/
Node_t* createComplex (Node_t* new_oper,
                       Node_t* old_oper,
                       Node_t* parent,
                       NameTable_t* table_var,
                       char* name_var);
// -------------------------------------------------------------------------------------------------------
// --------------------------------------------------------------------------------------------------
/**
 @brief Рекурсивная функция сокращения констант
 @param [in] node Указатель на корень поддерева
 @param [in] size Указатель на размер дерева
 @return node, если это константа, иначе NULL
*/
Node_t* calculateNum (Node_t* node,
                      size_t* size);
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 @brief Рекурсивная функция сокращения ненужных операций
 @param [in] node Указатель на корень поддерева
 @param [in] size Указатель на размер дерева
 @return Указатель на оптимизированное поддерево
*/
Node_t* abridgeNum (Node_t* node,
                    size_t* size);
// -------------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 @brief Функция налаживания родительских связей таким образом, что second заменяется на first
 @param [in] first Узел, на который заменяют
 @param [in] second Узел, который заменяют
*/
int replaceNearNode (Node_t* first,
                     Node_t* second);
// -------------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 @brief Функция оптимизации поддерева
 @param [in] node Указатель на поддерево
 @param [in] size Указатель на размер поддерева
*/
int optimizeNode (Node_t* node,
                  size_t* size);
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 @brief Функция замены переменных на их значения
 @param [in] tree Указатель на бинарное дерево
*/
int replaceTreeVar (BinTree_t* tree);
// -------------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 @brief Рекурсивная функция замены переменных в узлах поддерева
 @param [in] node Указатель на корень поддерева
 @param [in] table_var Таблица имен переменных
*/
int replaceNodeVar (Node_t* node,
                    NameTable_t* table_var);
// -------------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 @brief Функция получения значений переменных от пользователя
 @param [in] table_var Таблица имен переменных
*/
int getValueVar (NameTable_t* table_var);
// -------------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 @brief Функция создания ряда Тейлора до 0(x^4)
 @param [in] tree Указатель на дерево
*/
int makeTaylor (BinTree_t* tree);
// -------------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------------
/**
 @brief Функция записи поддерева в файла в формате GnuPlot
 @param [in] stream Указатель на файл
 @param [in] node Корень поддерева
 @param [in] table_var Таблица переменных
*/
int pushGnuPlotFunc (FILE* stream,
                     Node_t* node,
                     NameTable_t* table_var);
// -------------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------------
/**
 @brief Функция построения графика по математической формуле
 @param [in] tree Указатель на дерево
*/
int makeGraphic (BinTree_t* tree);
// -------------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------------
/**
 @brief Функция записи формулы по дереву для постройки графика
 @param [in] tree Указатель на дерево
*/
int makeGraphicSwing (BinTree_t* tree);
// -------------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------------
/**
 @brief Функция получения координаты точки касания
 @return X точки касания
*/
double getCoordSwing ();
// -------------------------------------------------------------------------------------------------------



// -------------------------------------------------------------------------------------------------------
/**
 * @brief Функция дампа дерева
 * @param [in] tree Указатель на структуру дерева
 * @param [in] reason Причина дампа
*/
int binTreeDumpHTML (BinTree_t* tree,
                     const char* reason);
// -------------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------------
/**
 * @brief Функция создания графа по дереву
 * @param [in] tree Указатель на причину дампа
 * @return 0 (если не было ошибок), иначе 1
*/
int createGraph (BinTree_t* tree);
// -------------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------------
/**
 @brief Рекурсивная функция создания блоков графа
 @param [in] node Указатель на текущий узел
 @param [in] stream Указатель на dot файл
 @param [in] table_var Таблица имен для переменных
 @param [in] table_cmd Таблица имен для кодовых слов
*/
int createBlock (Node_t* node,
                 FILE* stream,
                 NameTable_t* table_var,
                 NameTable_t* table_cmd);
// -------------------------------------------------------------------------------------------------------
// ------------------------------------------------------------------------------------------------------
/**
 @brief Функция описания блока дерева для кратного дампа
 @param [in] node Узел, блок которого описывается
 @param [in] stream Файл для вывода
 @param [in] table_var Таблица имен для переменных
 @param [in] table_cmd Таблица имен для кодовых слов
*/
int printFullBlock (Node_t* node,
                    FILE* stream,
                    NameTable_t* table_var,
                    NameTable_t* table_cmd);
// -------------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------------
/**
 @brief Функция распечатки адреса в HEX-формате
 @param [in] stream Файл для вывода
 @param [in] address Полученный адрес
*/
int printAddress (FILE* stream,
                  const void* address);
// -------------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------------
/**
 * @brief Рекурсивная функция создания связей между блоками
 * @param [in] node Указатель на текущий узел
 * @param [in] file Указатель на dot файл
 * @return 0
*/
int createLine (Node_t* node,
                FILE* file);
// -------------------------------------------------------------------------------------------------------



// -------------------------------------------------------------------------------------------------------
/**
 @brief Функция дампа дерева в LaTex файл
 @param [in] tree Указатель на структуру дерева
 @param [in] reason Причина вызова дампа
*/
int binTreeDumpLaTex (BinTree_t* tree,
                      const char* reason);
// -------------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------------
/**
 @brief Функция дампа
 @param [in] node Указатель на корень поддерева
 @param [in] table_var Таблица переменных
 @param [in] reason Причина дампа
 @see LATEX
*/
int dumpToLaTex (Node_t* node,
                 NameTable_t* table_var,
                 const char* reason);
// -------------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------------
/**
 @brief Рекурсивная функция записи формулы по поддереву
 @param [in] node Указатель на корень поддерева
 @param [in] stream Файл для вывода
 @param [in] table_var Таблица переменных
*/
int dumpNodeLaTex (Node_t* node,
                   FILE* stream,
                   NameTable_t* table_var);
// -------------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------------
/**
 @brief Функция очистки html файла и заполнения его заголовков
*/
int cleanHtml ();
// -------------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------------
/**
 @brief Функция очистки LaTex файла и заполнение его заголовков
*/
int cleanLaTex ();
// -------------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------------
/**
 @brief Функция очистки директории дампа бинарного дерева
*/
int cleanDump ();
// -------------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------------
/**
 * @brief Функция очистки выбранной директории
 * @param [in] address_dir Адрес выбранной директории
*/
int cleanDir (const char* address_dir);
// -------------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Фукнция очистки файла с графиком и заполнение его заголовков
*/
int cleanGraphic ();
// -------------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------------
/**
 @brief Функция вывода всей информации о узле
 @param [in] node Указатель на узел
*/
int dumpNode (Node_t* node);
// -------------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------------
/**
 @brief Функция выведения случайной фразы из файла
 @param [in] input_file Файл с фразами
 @param [in] output_stream Файл, куда эта фраза запишется
*/
int printRandomPhraze (const char* input_file,
                       FILE* output_stream);
// -------------------------------------------------------------------------------------------------------




#endif // BIN_TREE_FUNC_H
