#ifndef DIN_TREE_CONFIG_H
#define BIN_TREE_CONFIG_H


// -------------------------------------------------------------------------------------------------------
/// @brief Расположение dot файла
const char STANDARD_DUMP_DOT_ADR[] = "Dump/graph.dot";

/// @brief Расположение html файла
const char STANDARD_DUMP_HTML_ADR[] = "Dump/dump.html";

/// @brief Расположение директории с изображениями
const char STANDARD_DUMP_IMAGE_ADR[] = "Dump/Image/";
// -------------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------------
/// @brief Расположение стандартного файла для сохранения данных
const char STANDARD_SAVE_ADR[] = "Data/1.txt";

///  @brief Расположение стандартного файла для загрузки данных
const char STANDARD_UPLOAD_ADR[] = "Data/1.txt";
// -------------------------------------------------------------------------------------------------------


// -------------------------------------------------------------------------------------------------------
/// @brief Стандартный размер одного блока графа в dump
const size_t STANDARD_SIZE_GRAPH_BLOCK = 250;
// -------------------------------------------------------------------------------------------------------

















#endif // DIN_TREE_CONFIG_H


