#ifndef BIN_TREE_FUNC_H
#define BIN_TREE_FUNC_H

#include "BinTreeType.h"
#include "../../Common/Comands.h"

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция создания бинарного дерева
 @param [in] tree Структура дерева
 @note Сразу создается первый элемент
*/
int binTreeCtr (BinTree_t* tree);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция выделения памяти под новый объект
 @note Связи необходимо прописать вручную
 @return Указатель на блок памяти, где хранится новый узел
*/
Node_t* newNode ();
// ---------------------------------------------------------------------------------------------------


// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция удаления дерева
 @param [in] tree Указатель на структуру дерева
*/
int binTreeDtr (BinTree_t* tree);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Рекурсивная функция удаления поддерева
 @param [in] node Указатель на корень поддерева
*/
int deleteNode (Node_t* node);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция сохранения дерева в файл
 @param [in] tree Указатель на структуру дерева
*/
int binTreeSave (BinTree_t* tree);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Рекурсивная функция сохранения поддерева в файл
 @param [in] stream Указатель на файл, куда будет производится запись
 @param [in] node Указатель на корень поддерева
 @param [in] table_var Таблица имен с переменными
 @param [in] table_cmd Таблица имен с кодовыми словами
*/
int saveNode (FILE* stream,
              Node_t* node,
              NameTable_t* table_var,
              NameTable_t* table_cmd);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция загрузки дерева из файла
 @param [in] tree Указатель на структуру дерева
*/
int binTreeUpload (BinTree_t* tree);
// -------------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Рекурсивная функция парсинга буфера
 @param [in] parent Указатель на родительский элемент
 @param [in] cur_pose Указатель на адрес хранения адреса текущего рассматриваемого символа
 @param [in] table_var Таблица имен переменных
 @param [in] table_cmd Таблица имен команд
 @return Указатель на новый узел в случае необходимости его создания, иначе NULL
*/
Node_t* uploadNode (Node_t* parent,
                    char** cur_pose,
                    NameTable_t* table_var,
                    NameTable_t* table_cmd);
// -------------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция нахождения длины имени (до первого ' ')
 @param [in] name Полученное имя
 @return Длина имени
*/
int lenName (const char* name);
// -------------------------------------------------------------------------------------------------------

// ----------------------------------------------------------------------------------------------------
/**
 * @brief Функция скипа всего ненужного синтаксиса, указанного в SYNTAX_VOID
 * @param [in] Указатель на адрес хранения текущего символа
*/
int skipVoid (char** cur_pose);
// ----------------------------------------------------------------------------------------------------

// ----------------------------------------------------------------------------------------------------
/**
 @brief Функция поиска переменной в таблице имен
 @param [in] node Указатель на корень поддерева
 @param [in] table_var Таблица имен
 @param [in] name Имя переменной
 @return 0, если нет переменной, иначе 1 и больше
*/
int findVar (Node_t* node,
             NameTable_t* table_var,
             const char* name);
// -------------------------------------------------------------------------------------------------------


// --------------------------------------------------------------------------------------------------
/**
 @brief Функция дифференцирования дерева
 @param [in] old_tree Указатель на структуру старого дерева
 @param [in] new_tree Указатель на структуру нового дерева
 @note Удаляет старое
*/
int binTreeDiff (BinTree_t* old_tree,
                 BinTree_t* new_tree);
// -------------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 @brief Рекурсивная функция дифференцирования поддерева
 @param [in] old_node Указатель на узел старого поддерева
 @param [in] new_parent Указатель на родитель узла нового поддерева
 @param [in] name_var Переменная дифференцирования
 @param [in] table_var Таблица переменных
 @return Указатель на корень поддерева
*/
Node_t* diffNode (Node_t* old_node,
                  Node_t* new_parent,
                  char* name_var,
                  NameTable_t* table_var);
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 @brief Функция копирования поддерева в новое поддерево
 @param [in] old_node Указатель на корень старого поддерева
 @param [in] new_parent Указатель на корень нового поддерева
 @return Указатель на созданное поддерево
*/
Node_t* copyNode (Node_t* old_node,
                  Node_t* new_parent);
// -------------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 @brief Функция получения переменной дифференцирования
 @param [in] tree Указатель на структуру дерева
*/
int getVarDiff (BinTree_t* tree);
// -------------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 @brief Функция добавления узла с операцией
 @param [in] left Левое поддерево нового узла
 @param [in] right Правое поддерево нового узла
 @param [in] parent Родитель нового узла
 @param [in] oper Тип добавляемой операции
 @return Указатель на новой узел
*/
Node_t* createOperNodeBin (Node_t* left,
                           Node_t* right,
                           Node_t* parent,
                           ALL_OPER oper);
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 @brief Функция добавления узла с операцией
 @param [in] right Правое поддерево нового узла
 @param [in] parent Родитель нового узла
 @param [in] oper Тип добавляемой операции
 @return Указатель на новой узел
 @note left = NULL
*/
Node_t* createOperNodeAtom (Node_t* right,
                            Node_t* parent,
                            ALL_OPER oper);
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 @brief Функция создания узла с переменной
 @param [in] parent Указатель на родительский узел
 @param [in] index Индекс переменной в таблице имен
 @return Указатель на новый узел
*/
Node_t* createVarNode (Node_t* parent,
                       int index);
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 @brief Функция создания узла с числом
 @param [in] parent Указатель на родительский узел
 @param [in] value Значение числа
 @return Указатель на новый узел
*/
Node_t* createNumNode (Node_t* parent,
                       double value);
// -------------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 @brief Функция взятия производной сложной функции
 @param [in] new_oper Производная операции
 @param [in] old_oper Первоначальная операция
 @param [in] parent Указатель на родительский узел
 @param [in] table_var Таблица имен
 @param [in] name_var Имя переменной, по которой берется производная
 @return Указатель на корень нового поддерева
*/
Node_t* createComplex (Node_t* new_oper,
                       Node_t* old_oper,
                       Node_t* parent,
                       NameTable_t* table_var,
                       char* name_var);
// -------------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 @brief Рекурсивная функция сокращения констант
 @param [in] node Указатель на корень поддерева
 @param [in] size Указатель на размер дерева
 @return node
*/
Node_t* calculateNum (Node_t* node,
                      size_t* size);
// --------------------------------------------------------------------------------------------------



// -------------------------------------------------------------------------------------------------------
/**
 * @brief Функция дампа дерева
 * @param [in] tree Указатель на структуру дерева
 * @param [in] reason Причина дампа
*/
int binTreeDumpHTML (BinTree_t* tree,
              const char* reason);
// -------------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------------
/**
 * @brief Функция создания графа по дереву
 * @param [in] tree Указатель на причину дампа
 * @return 0 (если не было ошибок), иначе 1
*/
int createGraph (BinTree_t* tree);
// -------------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------------
/**
 @brief Рекурсивная функция создания блоков графа
 @param [in] node Указатель на текущий узел
 @param [in] stream Указатель на dot файл
 @param [in] table_var Таблица имен для переменных
 @param [in] table_cmd Таблица имен для кодовых слов
*/
int createBlock (Node_t* node,
                 FILE* stream,
                 NameTable_t* table_var,
                 NameTable_t* table_cmd);
// -------------------------------------------------------------------------------------------------------
// ------------------------------------------------------------------------------------------------------
/**
 @brief Функция описания блока дерева для кратного дампа
 @param [in] node Узел, блок которого описывается
 @param [in] stream Файл для вывода
 @param [in] table_var Таблица имен для переменных
 @param [in] table_cmd Таблица имен для кодовых слов
*/
int printFullBlock (Node_t* node,
                    FILE* stream,
                    NameTable_t* table_var,
                    NameTable_t* table_cmd);
// -------------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------------
/**
 @brief Функция распечатки адреса в HEX-формате
 @param [in] stream Файл для вывода
 @param [in] address Полученный адрес
*/
int printAddress (FILE* stream,
                  const void* address);
// -------------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------------
/**
 * @brief Рекурсивная функция создания связей между блоками
 * @param [in] node Указатель на текущий узел
 * @param [in] file Указатель на dot файл
 * @return 0
*/
int createLine (Node_t* node,
                FILE* file);
// -------------------------------------------------------------------------------------------------------



// -------------------------------------------------------------------------------------------------------
/**
 @brief Функция дампа дерева в LaTex файл
 @param [in] tree Указатель на структуру дерева
*/
int binTreeDumpLaTex (BinTree_t* tree);
// -------------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------------
/**
 @brief Функция дампа
 @param [in] node Указатель на корень поддерева
 @param [in] table_var Таблица переменных
*/
int dumpToLaTex (Node_t* node,
                 NameTable_t* table_var);
// -------------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------------
/**
 @brief Рекурсивная функция записи формулы по поддереву
 @param [in] node Указатель на корень поддерева
 @param [in] stream Файл для вывода
 @param [in] table_var Таблица переменных
*/
int dumpNodeLaTex (Node_t* node,
                   FILE* stream,
                   NameTable_t* table_var);
// -------------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------------
/**
 @brief Функция создания html файла и заполнения его заголовков
*/
int createHtml ();
// -------------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------------
/**
 @brief Функция создания LaTex файла и заполнение его заголовков
*/
int createLaTex ();
// -------------------------------------------------------------------------------------------------------



#endif // BIN_TREE_FUNC_H
