#ifndef BIN_TREE_CONFIG_H
#define BIN_TREE_CONFIG_H

#define DEBUG_MODE

// -------------------------------------------------------------------------------------------------------
/// @brief Расположение директории с дампами дерева
const char STANDARD_DUMP_DIR_ADR[] = "Dump/BinTree";

/// @brief Расположение dot файла
const char STANDARD_DUMP_DOT_ADR[] = "Dump/BinTree/graph.dot";

/// @brief Расположение html файла
const char STANDARD_DUMP_HTML_ADR[] = "Dump/BinTree/dump.html";

/// @brief Расположение директории с изображениями
const char STANDARD_DUMP_IMAGE_ADR[] = "Dump/BinTree/Image/";

/// @brief Расположение tex файла
const char STANDARD_DUMP_LATEX_ADR[] = "Dump/BinTree/dump.tex";

/// @brief Расположение файла с графиками
const char STANDARD_GRAPHIC_ADR[] = "Dump/BinTree/plot.plt";

/// @brief Расположение файла с изобрадениями графиков
const char STANDARD_GRAPHIC_PNG_ADR[] = "Dump/BinTree/Graphic";
// -------------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------------
/// @brief Расположение стандартного файла для сохранения данных
const char STANDARD_SAVE_ADR[] = "Data/prog.txt";

///  @brief Расположение стандартного файла для загрузки данных
const char STANDARD_UPLOAD_ADR[] = "Data/prog.txt";
// -------------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------------
/// @brief Стандартный размер одного блока графа в dump
const size_t STANDARD_SIZE_GRAPH_BLOCK = 250;
// -------------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------------
/// @brief Расположение файла с фразами для дифференцирования
const char STANDARD_PHRAZE_ADR[] = "praze.txt";
// -------------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------------
/// @brief
const int WIDTH_GRAPH = 1;

/// @brief
const int HEIGHT_GRAPH = 1;
// -------------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------------
/// @brief
const int POWER_TAYLOR = 10;
// -------------------------------------------------------------------------------------------------------



#endif // DIN_TREE_CONFIG_H


