#ifndef DIFF_FUNC_H
#define DIFF_FUNC_H

#include "config.h"

// ---------------------------------------------------------------------------------------------------
/**
 @brief Очистка всех системных файлов этой библиотеки
*/
int DIFF_Init ();
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция создания объекта для дальнейшей работы с ним
 @return Объект (binTree_t*)
*/
DIFF_Tree_t DIFF_TreeCtr ();
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция загрузки математической функции в объект
 @param [in] tree Объект, куда будет загружена информация
 @param [in] file Имя файла, откуда будет взята информация
*/
int DIFF_GetTree (DIFF_Tree_t tree,
                  const char* file);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция взятия производной математической функции, загруженной в объект
 @param [in] tree Объект
*/
int DIFF_BringDiff (DIFF_Tree_t* tree);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция удаления объекта
 @param [in] tree Объект
*/
int DIFF_TreeDtr (DIFF_Tree_t tree);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция оптимизации объекта
 @param [in] tree Объект
*/
int DIFF_Optimization (DIFF_Tree_t tree);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция завершения работы библиотеки
*/
int DIFF_Quit ();
// ---------------------------------------------------------------------------------------------------



#endif // DIFF_FUNC_H
