#ifndef PARSER_FUNC_H
#define PARSER_FUNC_H

#include "ParserType.h"
#include "../Common/AllTypes.h"

// ---------------------------------------------------------------------------------------------------
/*
    Основные правила этой грамматики
    Global  ::= AddSub && '$'
    AddSub  ::= MulDiv  {['+' | '-'] && MulDiv}(while)
    MulDiv  ::= Brack   {['*' | '/'] && Brack}(while)
    Brack   ::= '(' AddSub ')' | NumVar
    NumVar  ::= Num | Func | Var
    Num     ::= [0-9] {'.' && [0-9]}(if)
    Func    ::= [nameFunc] && '(' AddSub ')'
    Var     ::= [!nameFunc]
*/
// ---------------------------------------------------------------------------------------------------


// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция считывания полного выражения (Правило Global)
 @param [in] inf Структура с информацией о текущем положении и ошибке
 @return Указатель на поддерево выражения
*/
Node_t* parserGetGlobal (ParserPlaceInf_t* inf);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция считывания чисел и переменных (Правило NumVar)
 @param [in] inf Структура с информацией о текущем положении и ошибке
 @return Указатель на поддерево выражения
*/
Node_t* parserGetNumVar (ParserPlaceInf_t* inf);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция считывания скобок (Правило Brack)
 @param [in] inf Структура с информацией о текущем положении и ошибке
 @return Указатель на поддерево выражения
*/
Node_t* parserGetBrackets (ParserPlaceInf_t* inf);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция считывания сложений и вычитаний выражений (Правило AddSub)
 @param [in] inf Структура с информацией о текущем положении и ошибке
 @return Указатель на поддерево выражения
*/
Node_t* parserGetAddSub (ParserPlaceInf_t* inf);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция считывания умножения и деления выражений (Правило MulDiv)
 @param [in] inf Структура с информацией о текущем положении и ошибке
 @return Указатель на поддерево выражения
*/
Node_t* parserGetMulDiv (ParserPlaceInf_t* inf);
// ---------------------------------------------------------------------------------------------------
































#endif /* #ifndef PARSER_FUNC_H */
