#ifndef PARSER_FUNC_H
#define PARSER_FUNC_H

#include "../Common/AllTypes.h"
#include "../Common/Common.h"

#include "ParserType.h"
#include "ParserConst.h"


// ---------------------------------------------------------------------------------------------------
/*
    Основные правила этой грамматики
    Global  ::= AddSub && '$'
    AddSub  ::= MulDiv  {['+' | '-'] && MulDiv}(while)
    MulDiv  ::= Brack   {['*' | '/'] && Brack}(while)
    Brack   ::= '(' AddSub ')' | NumVar
    NumVar  ::= Num | Func | Var
    Num     ::= [0-9] {'.' && [0-9]}(if)
    Func    ::= [nameFunc] && '(' AddSub {[','] && AddSub}(if) ')'
    Var     ::= [!nameFunc]
*/
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/// @brief Обработка синтаксических ошибок
#define SYNTAX_ERROR(inf, error_type, ret_val)       \
    do {                                        \
        DIFF_Error ("Syntax error in parser");  \
        printf ("Syntax error in: [# %s #]\n"   \
                "Full string: [# %s #]\n"       \
                "Desc error: %s\n",             \
                *(inf->pose), inf->start_pose,  \
                DESC_PARSER_ERROR[error_type]);      \
        inf->error = error_type;                \
        return ret_val;                         \
    } while (false)
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция считывания полного выражения (Правило Global)
 @param [in] inf Структура с информацией о текущем положении и ошибке
 @param [in] table_var Таблица имен переменных
 @param [in] table_cmd Таблица имен функций
 @return Указатель на поддерево выражения
*/
Node_t* parserGetGlobal (ParserPlaceInf_t* inf,
                         NameTable_t* table_var,
                         NameTable_t* table_cmd);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция считывания чисел и переменных (Правило NumVar)
 @param [in] inf Структура с информацией о текущем положении и ошибке
 @param [in] table_var Таблица имен переменных
 @param [in] table_cmd Таблица имен функций
 @return Указатель на поддерево выражения
*/
Node_t* parserGetNumVar (ParserPlaceInf_t* inf,
                         NameTable_t* table_var,
                         NameTable_t* table_cmd);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция чтения чисел (Правило Num)
 @param [in] inf Структура с информацией о текущем положении и ошибке
 @param [in] node Указатель на узел, куда будет записано число
*/
int parserNum (ParserPlaceInf_t* inf,
               Node_t* node);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция чтения функций (Правило Func)
 @param [in] inf Структура с информацией о текущем положении и ошибке
 @param [in] node Указатель на узел с функцией
 @param [in] table_cmd Таблица имен функций
 @return 1, если это функция, иначе 0
*/
int parserFunc (ParserPlaceInf_t* inf,
                Node_t* node,
                NameTable_t* table_cmd);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция чтения переменных (Правило Var)
 @param [in] inf Структура с информацией о текущем положении и ошибке
 @param [in] node Указатель на узел с переменной
 @param [in] table_var Таблица имен переменных
*/
int parserVar (ParserPlaceInf_t* inf,
               Node_t* node,
               NameTable_t* table_var);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция считывания скобок (Правило Brack)
 @param [in] inf Структура с информацией о текущем положении и ошибке
 @param [in] table_var Таблица имен переменных
 @param [in] table_cmd Таблица имен функций
 @return Указатель на поддерево выражения
*/
Node_t* parserGetBrackets (ParserPlaceInf_t* inf,
                           NameTable_t* table_var,
                           NameTable_t* table_cmd);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция считывания сложений и вычитаний выражений (Правило AddSub)
 @param [in] inf Структура с информацией о текущем положении и ошибке
 @param [in] table_var Таблица имен переменных
 @param [in] table_cmd Таблица имен функций
 @return Указатель на поддерево выражения
*/
Node_t* parserGetAddSub (ParserPlaceInf_t* inf,
                         NameTable_t* table_var,
                         NameTable_t* table_cmd);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция считывания умножения и деления выражений (Правило MulDiv)
 @param [in] inf Структура с информацией о текущем положении и ошибке
 @param [in] table_var Таблица имен переменных
 @param [in] table_cmd Таблица имен функций
 @return Указатель на поддерево выражения
*/
Node_t* parserGetMulDiv (ParserPlaceInf_t* inf,
                         NameTable_t* table_var,
                         NameTable_t* table_cmd);
// ---------------------------------------------------------------------------------------------------
































#endif /* #ifndef PARSER_FUNC_H */
