#ifndef PARSER_TYPE_H
#define PARSER_TYPE_H


// ---------------------------------------------------------------------------------------------------
/// @brief Все возможное ошибки во время парсинга
enum ParserError_t
{
    NOT_ERROR           = 0,
    NO_END_CHAR         = 1,
    NO_BACK_BRACKET     = 2,
    UNKOWN_NUM_VAR      = 3
};
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Структура, содержащая информацию о ткущем местоположении и ошибках
 @param pose Текущая позиция
 @param start_pose Начальная позиция
 @param error Текущая ошибка
*/
struct ParserPlaceInf_t
{
    char** pose;
    char* start_pose;
    ParserError_t error;
};
// ---------------------------------------------------------------------------------------------------














#endif // PARSER_TYPE_H
