#ifndef COMMON_H
#define COMMON_H

// ---------------------------------------------------------------------------------------------------
#define EXIT_FUNC(reason, ret_var)                                  \
    do {                                                            \
        printf ("ERROR in %s:%d : %s", __FILE__, __LINE__, reason); \
        return ret_var;                                             \
    } while (0)
// ---------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 * @brief Хеш-функция
 * @param [in] string Строка, которая преобразуется в хеш
 * @return Хеш строки
*/
size_t getHash (const char* string);
// --------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------------
/**
 * @brief Функция, находящая размер файла в байтах по его имени
 * @param [in] name_file Имя файла
 * @return Размер файла
*/
size_t getFileSize (const char* name_file);
// -------------------------------------------------------------------------------------------------------




#endif // COMMON_H
